{"articles":[{"title":"01: Six CSS Snippets Every Front-End Developer Should Know in 2023","link":"https://frontendfoc.us/link/149418/web","description":"This look at a half-dozen toolbelt worthy, powerful, and broadly cross-compatible CSS techniques (including logical properties and container queries) proved very popular, and was the top link shared in Frontend Focus last year. Everything remains relevant in 2024 too, of course!&nbsp;😏","source":"web.dev","author":"Adam Argyle ","category":"topnews"},{"title":"02: A Deep Dive Into SVG Path Commands","link":"https://frontendfoc.us/link/149419/web","description":"A very well presented, interactive guide to understanding SVG paths and path commands — it covers cursors, lines, bézier curves, and more, and remains a bookmark-worthy&nbsp;resource.","source":"www.nan.fyi","author":"Nanda Syahrasyad ","category":"topnews"},{"title":"03: If Web Components Are So Great, Why Am I Not Using Them?","link":"https://frontendfoc.us/link/149420/web","description":"There was plenty of <a target=\"_blank\" href=\"https://frontendfoc.us/link/149421/web\" style=\"text-decoration: none; color: #D94306;\">renewed chatter and attention</a> on Web Components in the latter half of 2023, kicked off in part by Dave's analysis on the 'marketing problem' that this relatively slowly-adopted technology may have.","source":"daverupert.com","author":"Dave Rupert ","category":"topnews"},{"title":"04: ▶️ 21 Awesome Web Features You’re Not Using Yet","link":"https://frontendfoc.us/link/149425/web","description":"An eight-minute video that's closing in on nearly a million views now. It runs through some of the then-new features on the web platform, and remains a solid high-level, informative run&nbsp;through.","source":"www.youtube.com","author":"Fireship ","category":"topnews"},{"title":"05: A Blog Post with Every HTML Element","link":"https://frontendfoc.us/link/149426/web","description":"A mammoth effort here — it's a bold attempt to squeeze every single valid HTML element (along with some <em>former</em> elements like <code>&lt;marquee&gt;</code> and <code>&lt;blink&gt;</code>) into a single place.","source":"www.patrickweaver.net","author":"Patrick Weaver ","category":"topnews"},{"title":"06: Ten Weird HTML Hacks That Shaped the Internet","link":"https://frontendfoc.us/link/149428/web","description":"A superb, curious history lesson here looking back at old table hacks, CSS kludges, and various quirky coding strategies that helped web developers get things looking good before we had the modern tools at our disposal&nbsp;now.","source":"tedium.co","author":"Ernie Smith ","category":"topnews"},{"title":"07: The Top Front-End Tools of 2022","link":"https://frontendfoc.us/link/149429/web","description":"It might feel a bit dated to share a 2022 round-up in 2024, but this collection of handy frontend tools remains relevant nonetheless with plenty of tools to help speed up your&nbsp;workflow.","source":"www.smashingmagazine.com","author":"Louis Lazaris ","category":"topnews"},{"title":"08: The Truth About CSS Selector Performance","link":"https://frontendfoc.us/link/149430/web","description":"It's true. Certain CSS selectors are faster than others. This article explains, outlining the ones that are important to keep an eye on for performance.","source":"blogs.windows.com","author":"Patrick Brosset ","category":"topnews"},{"title":"09: An Interactive Guide to CSS Grid","link":"https://frontendfoc.us/link/149431/web","description":"An excellent primer from Josh on all things CSS Grid, sharing a mental model we can adopt in order to best understand how CSS Grid works and how we can use it effectively.","source":"www.joshwcomeau.com","author":"Josh Comeau ","category":"topnews"},{"title":"10: The 'End' of Front-End Development","link":"https://frontendfoc.us/link/149433/web","description":"Another from Josh, this time addressing the rise of AI language models and how they may impact programming. Josh noted he was “<em>much more optimistic about what these AI advancements mean for the future of software&nbsp;development</em>”.","source":"www.joshwcomeau.com","author":"Josh W. Comeau ","category":"topnews"}]}